---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallAlignKeyRefParam
source: html/32a09619-fe4d-047a-c8ee-c346621b4a9e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallAlignKeyRefParam Property

"Location line to align"

## Syntax (C#)
```csharp
public static ForgeTypeId WallAlignKeyRefParam { get; }
```